# 1. Создайте функцию-генератор.
# Функция генерирует N простых чисел, начиная с числа 2.
# Для проверки числа на простоту используйте правило: «число является простым, если делится нацело только на единицу и на себя».

def generate_primes(n):
    count = 0
    num = 2
    while count < n:
        for i in range(2, int(num**0.5) + 1):
            if num % i == 0:
                break
        else:
            yield num
            count += 1
        num += 1

prime = generate_primes(int(input('Введите число: ')))
print(*prime)